Repository: 84000/data-translation-memory
Catalog: toh67-v3.tmx
Source language: bo
Languages: en

source: དེ་དེའི་ཚེ་ན་ཁྱིམ་ཐམས་ཅད་ལ་མངོན་པར་མི་དགའ་བར་གྱུར་ཅིང་དེ་འདི་སྙམ་དུ་ཁྱིམ་གྱི་གནས་ན་གནས་པས་ལུས་འདི་ལྟ་བུ་བསྒྲུབ་པར་མི་ནུས་པས་དེའི་ཕྱིར་བདག་མངོན་པར་འབྱུང་བར་བྱའོ་སྙམ་དུ་སེམས་པར་གྱུར་ཏོ།
en: At that time, he lost all joy in his household, thinking that by staying at home he would be unable to accomplish such a body. So he decided to renounce his home. “

source: །འོད་སྲུང་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཆེན་པོ་སྐྱེས་ནས་ལོ་བཅུ་དྲུག་ལོན་ལ་དབང་པོ་རྣམས་རྒྱས་ཤིང་ཡོངས་སུ་སྨིན་པ་ཡང་རྗེས་སུ་ཐོབ་ནས་རང་གི་ཕ་མ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་རང་གི་ཕ་མ་གཉིས་ཀྱི་རྐང་པ་དག་ལ་ཕྱག་འཚལ་ཏེ།
en: Kāśyapa, when the bodhisattva Great Diligence reached the age of sixteen, his faculties reached full bloom and he attained maturity.

source: འདི་སྐད་ཅེས་སྨྲས་སོ། །ཡབ་ཡུམ་བདག་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་ཁྱིམ་ནས་ཁྱིམ་མ་མཆིས་པར་ལེགས་པ་ཁོ་ནར་རབ་ཏུ་འབྱུང་བར་ཅི་གནང་།
en: Then he went to his parents, and when he arrived in their presence, he prostrated at their feet, saying, ‘Father and mother, will you grant me permission to go forth from home into homelessness in the teaching of the Tathāgata, just as is proper?’ “

source: ཕ་མས་སྨྲས་པ། གཞོན་ནུ་ཁྱོད་དེ་སྐད་མ་ཟེར་ཅིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ངེད་གཉིས་ལ་བུ་གཅིག་པ། སྡུག་པ།
en: His parents replied, ‘Boy, do not say that—we two have no dear, beloved, and handsome only-son but you!

source: ཕངས་པ། ཡིད་དུ་འོང་བ་ཁྱོད་ལས་མེད་པས། གལ་ཏེ་ཁྱོད་མ་མཐོང་ན་འཆི་བའི་དུས་བྱེད་པར་འགྱུར་བའི་ཕྱིར་རོ།
en: If we do not see you, it will be the death of us.’ “

source: །ཁྱེའུས་སྨྲས་པ། བདག་གིས་ཅི་ནས་ཀྱང་ཁྱེད་གཉིས་ཀྱང་ནོངས་པར་མི་འགྱུར་ལ་བདག་ཀྱང་མངོན་པར་འབྱུང་བར་འགྱུར་བ་དེ་ལྟར་བགྱི་ལགས་སོ།
en: The boy replied, ‘While I will certainly not harm the two of you, I will still renounce my home.’ “

source: །ཕ་མས་སྨྲས་པ། གཞོན་ནུ་ཇི་ལྟར་བྱ།
en: His parents answered, ‘How will you do that, boy?’ “

source: ཁྱེའུས་སྨྲས་པ། བདག་དེང་སླན་ཆད་ཇི་སྲིད་དུ་མངོན་པར་འབྱུང་བར་མ་གྱུར་པ་དེ་སྲིད་དུ་འཚལ་མ་ཡང་མི་འཚལ། མལ་དུ་ཡང་མི་འཇུག །མར་སར་དང་འབྲུ་མར་གྱིས་ཀྱང་མི་ཉུག །སྐོམ་ཡང་མི་འཚལ།
en: The boy replied, ‘Starting from today, for as long as I do not renounce home, I will not ask for food, go to bed, rub myself with butter or oil, or ask for a drink.

source: དགེ་བ་འམ་མི་དགེ་བའི་ཚིག་འགའ་ཡང་མི་སྨྲ་ལགས་སོ།
en: Nor will I utter a single word, whether virtuous or nonvirtuous.’ “

source: །འོད་སྲུང་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཆེན་པོ་དེས་ས་ཕྱོགས་བྱི་དོར་མ་བྱས་པ་ཞིག་ཏུ་འདུག་སྟེ་ཅང་མི་སྨྲ་བར་གྱུར་ཅིང་ཉིན་གཅིག་ཟན་ཡང་མ་ཟོས་སོ། །དེ་ནས་དེའི་ཕ་མ་གཉིས་ཀྱིས་རོ་བརྒྱ་དང་ལྡན་པའི་ཁ་ཟས་ཐོགས་ཏེ།
en: Then, Kāśyapa, the bodhisattva Great Diligence sat down in an unswept place, fell silent, and ate no food for one day. His parents brought him food of a hundred flavors, but he did not speak.

source: གཞན་ཚིག་ཏུ་མི་རྗོད་ཅིང་ཉིན་མཚན་ཐོག་ཐག་ཏུ་དེ་ལ་གསོལ་བ་བཏབ་ཀྱང་དེ་ཚིག་ཙམ་ཡང་མི་སྨྲ་བར་གྱུར་ཏོ།
en: Although they pleaded with him all day and night, he did not speak a single word. “

source: །འོད་སྲུང་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཆེན་པོ་དེ་ཅང་མི་སྨྲ་བར་ཞག་གཉིས་ཀྱི་བར་དུ་ཟན་མ་ཟོས་པ་དང་།
en: In this way, Kāśyapa, the bodhisattva Great Diligence fell silent for a second day and ate no food.

source: དེ་ནས་མའི་ཉེ་དུ་ལྔ་བརྒྱ་ཙམ་དག་གིས་རོ་བརྒྱ་དང་ལྡན་པའི་ཁ་ཟས་ཐོགས་ཏེ།
en: Then five hundred of his maternal relatives brought food of a hundred flavors, but he did not speak.

source: གཞན་ཚིག་ཏུ་མ་རྗོད་ཅིང་ཉིན་མཚན་ཐོག་ཐག་ཏུ་གསོལ་བ་བཏབ་ཀྱང་དེ་དག་གི་གདོང་དུ་ཡང་མི་ལྟ་ན་ཚིག་སྨྲ་བ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Although they pleaded with him all day and night, he never even looked them in the face, never mind speaking a word. “

source: འོད་སྲུང་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཆེན་པོ་དེ་ཅང་མི་སྨྲ་བར་ཞག་གསུམ་གྱི་བར་དུ་ཟན་མ་ཟོས་པ་དང་།
en: In that way, Kāśyapa, the bodhisattva Great Diligence fell silent for a third day and ate no food.

source: དེ་ནས་ཕའི་ཉེ་དུ་ལྔ་བརྒྱ་ཙམ་དག་གིས་རོ་བརྒྱ་དང་ལྡན་པའི་ཁ་ཟས་ཐོགས་ཏེ་གཞན་ཚིག་ཏུ་མི་རྗོད་ཅིང་ཉིན་མཚན་ཐོག་ཐག་ཏུ་གསོལ་བ་བཏབ་ཀྱང་དེ་དག་གི་གདོང་དུ་ཡང་མི་ལྟ་ཚིག་ཀྱང་མི་སྨྲའོ།
en: Then five hundred of his paternal relatives brought him food of a hundred flavors. But he did not speak. Although they pleaded with him all day and night, he never even looked them in the face, and he did not speak a word. “

source: །འོད་སྲུང་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཆེན་པོ་དེ་ཅང་མི་སྨྲ་བར་ཞག་བཞིའི་བར་དུ་ཟན་མ་ཟོས་པ་དང་།
en: In that way, Kāśyapa, the bodhisattva Great Diligence fell silent for a fourth day and ate no food.

source: དེ་ནས་དེའི་ནེའུ་ལྡངས་ལྔ་བརྒྱ་དག་གིས་རོ་བརྒྱ་དང་ལྡན་པའི་ཁ་ཟས་ཐོགས་ཏེ།
en: Then five hundred of his own cohort brought him food of a hundred flavors, but he did not speak.

source: གཞན་ཚིག་ཏུ་མི་རྗོད་ཅིང་ཉིན་མཚན་ཐོག་ཐག་ཏུ་གསོལ་བ་བཏབ་ཀྱང་དེ་དག་གི་གདོང་དུ་ཡང་མི་ལྟ་ན་ཚིག་སྨྲ་བ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Although they pleaded with him all day and night, he never even looked them in the face, never mind speaking a word. “

source: འོད་སྲུང་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཆེན་པོ་དེ་ཅང་མི་སྨྲ་བར་ཞག་ལྔའི་བར་དུ་ཟན་མ་ཟོས་པ་དང་། དེ་ནས་དེའི་ཕ་མ་གཉིས་ཀྱིས་རྒྱལ་པོའི་ཕོ་བྲང་ན་འགྲོན་བུ་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་
en: In that way, Kāśyapa, the bodhisattva Great Diligence fell silent for a fifth day and ate no food.

source: དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། ས་ལེ་སྦྲམ་དང་། དངུལ་དང་། གཞན་ཡང་རིན་པོ་ཆེ་དང་།
en: Then his parents put to one side all the cowry shells, gold, precious stones, pearls, beryl, conches, crystals, gold dust, silver, and, furthermore, jewels, clothing, and various ornaments that could be found in the king’s palace.

source: གོས་དང་། རྒྱན་སྣ་ཚོགས་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཕྱོགས་གཅིག་ཏུ་བཞག་སྟེ། ན་ཆུང་ལྷའི་བུ་མོ་འདྲ་བ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་བཀུག་སྟེ་ཕྱོགས་གཅིག་ཏུ་བཀོད་དོ།
en: They summoned eighty-four thousand young women who were like goddesses, adorned them with all the ornaments, and stood them to one side. “

source: །འོད་སྲུང་མདོར་ན་རྒྱལ་པོའི་ཕོ་བྲང་དེ་ན་ཉེ་བར་སྤྱད་པའི་ལོངས་སྤྱོད་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་དེའི་མདུན་དུ་བཞག་སྟེ།
en: In short, Kāśyapa, they set before him all the enjoyments to be had in the king’s palace.

source: དེའི་ཕ་མ་གཉིས་ཀྱིས་མའི་ཉེ་དུ་ལྔ་བརྒྱ་ཙམ་པོ་དག་དང་། ཕའི་ཉེ་དུ་ལྔ་བརྒྱ་ཙམ་པོ་དག་དང་། ནེའུ་ལྡངས་ལྔ་བརྒྱ་ཙམ་པོ་དག་དང་། ན་ཆུང་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དག་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཆེན་པོ་དེའི་མདུན་དུ་བཀོད་ནས་རོ་བརྒྱ་དང་ལྡན་པའི་ཁ་ཟས་ཐོགས་ཏེ།
en: His parents placed before the bodhisattva Great Diligence his five hundred maternal relatives, his five hundred paternal relatives, the five hundred of his own cohort, the eighty-four thousand young women, and a crowd of people, who then brought him food of a hundred flavors, but he did not speak.

source: གཞན་ཚིག་ཏུ་མ་བརྗོད་ཅིང་ཉིན་མཚན་ཐོག་ཐག་ཏུ་གསོལ་བ་འདེབས་ཏེ། དེ་ལ་འདི་སྐད་ཅེས་གཞོན་ནུ་ལོངས་ལ་ཟན་ཟོ།
en: They pleaded with him all day and night, saying, ‘Young man, get up and eat some food!

source: །ཁྱིམ་འདིར་འདུག་ལ་སྦྱིན་པ་དག་ཀྱང་བྱིན་ཅིག །བསོད་ནམས་དག་ཀྱང་གྱིས་ཤིག །
en: Give alms and perform acts of merit while staying here at home.

source: བུད་མེད་འདི་དག་དང་ལྷན་ཅིག་ཏུ་དགའ་བ་དང་། རྩེད་མོ་དང་། དགའ་མགུར་སྤྱད་པ་དག་ཀྱང་གྱིས་ལ་རྒྱལ་པོའི་ཁྱིམ་འདི་ལྟ་བུ་ཡོངས་སུ་མ་བཏང་ཤིག་ཅེས་ཀྱང་སྨྲས་སོ།
en: Enjoy yourself with these women; frolic and make love—do not abandon the king’s palace like this!’ “

source: །འོད་སྲུང་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཆེན་པོ་དེ་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་ལྟར་འདུས་པ་དེ་དག་ལ་མིག་ཀྱང་མི་ལྟ་ཕྱིར་ཡང་མི་སྨྲ་བར་དེ་བཞིན་དུ་ཅང་མི་སྨྲ་བར་འདུག་ཅིང་ཞག་དྲུག་གི་བར་དུ་ཟན་ཡང་མ་ཟོས་པར་དེ་སངས་རྒྱས་དཀོན་མཆོག་དང་འབྲེལ་པའི་ཡིད་ལ་བྱེད་པ་མ་གཏོགས་པར་ཡིད་ལ་བྱེད་པ་གཞན་ཐམས་ཅད་དང་བྲལ་ཞིང་ཁ་ཟས་ཀྱི་འདུ་ཤེས་ཀྱང་མ་བསྐྱེད་དོ།
en: Kāśyapa, the bodhisattva Great Diligence never even looked at the crowd of people who had assembled, and he did not speak again. He remained silent in that way for a sixth day and ate no food. He was free of all other thoughts except for thoughts connected with the Buddha jewel. He never even gave rise to the concept of food. “

source: །འོད་སྲུང་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཆེན་པོ་དེའི་ཕ་མ་དེ་གཉིས་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་དང་། ནེའུ་ལྡངས་དེ་དག་དང་། ཉེ་དུའི་ཚོགས་ཆེན་པོ་དེ་དག་དང་། བུད་མེད་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་བཞིན་ལ་མཆི་མའི་རྒྱུན་བླགས་ཤིང་སྐད་ཕྱུང་སྟེ་ངུད་མོས་བཏབ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེའི་རྐང་པ་གཉིས་ལ་གཏུགས་ཀྱང་དེ་དེ་དག་གི་གདོང་དུ་ཡང་མི་ལྟའོ།
en: Then, Kāśyapa, the parents of the bodhisattva Great Diligence and those crowds of people, those in his cohort, the great gathering of relatives, and the eighty-four thousand women all wailed and cried out with tears streaming down their faces. Even though they touched his feet in supplication, he never even looked at them. “

source: །འོད་སྲུང་དེ་ནས་རྒྱལ་པོའི་ཕོ་བྲང་དེ་ན་ལྷ་ཞིག་གནས་པར་གྱུར་པ་གང་ཡིན་པ་དེ་སྟེང་གི་བར་སྣང་ལ་ཆོ་འཕྲུལ་ཆེན་པོས་འདུག་ནས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། གང་དག་བྱང་ཆུབ་ཕྱིར་བརྩོན་པ། །དེ་དག་ལྷུན་པོ་འདྲ་བར་ནི། །མཐུ་བརྟན་རབ་ཏུ་མི་གཡོ་སྟེ།
en: Then, Kāśyapa, a deity who happened to live in the king’s palace appeared, by a great miracle, in midair and spoke these verses to the crowds of people: “ ‘Those who strive for awakening Are like Meru: Powerful, firm, and immovable.

source: །ཡི་དམ་གཏོང་བར་མི་བྱེད་དོ།
en: They do not forsake their vows. “ ‘

source: །ས་རྣམས་ཐམས་ཅད་གཡོ་ཡང་སྲིད། །མེ་ནི་ཆུར་ཡང་འགྱུར་ཡང་སྲིད། །གྲོགས་དག་འདི་ནི་གནས་འདི་ལས། །བསྐྱོད་པར་ནུས་པ་མ་ཡིན་ནོ།
en: All the lands can shake, And fire can turn into water, But he, my friends, cannot be moved From this place! “ ‘

source: །འདི་ལ་མི་དགའ་ཕྱིས་མི་བྱ།
en: From now on, do not be sad!

source: །སྡིག་པའི་ལས་རྣམས་མ་བྱེད་ཅིག །
en: Commit no sinful actions!

source: ཕྱིན་ཆད་དམུས་ལོང་འདྲ་བར་ནི། །བསྐལ་པ་བྱེ་བར་འཁྱམས་ས་རེ།
en: Or henceforth, like a blind person, You are sure to wander for ten million eons. “ ‘

source: །འདི་ནི་སེམས་ཅན་ཐམས་ཅད་ལ། །ཕན་ཕྱིར་བྱང་ཆུབ་ཞུགས་པ་སྟེ། །མངོན་པར་འབྱུང་ཕྱིར་བརྩོན་རྣམས་ནི། །བྱང་ཆུབ་དམ་པ་རྙེད་མི་དཀའ།
en: In order to benefit all beings, He has set out for awakening; For those who strive in order to renounce, Sublime awakening is not hard to find. “ ‘

source: །འདོད་པའི་ཕྱིར་དང་ལོངས་སྤྱོད་ཕྱིར། །བྱང་ཆུབ་སྤྱད་པ་མི་སྤྱོད་ཀྱི། །སེམས་ཅན་གང་དག་སངས་རྒྱས་ཀྱི། །ཡེ་ཤེས་ཚོལ་རྣམས་ཇི་ལྟར་བདེ།
en: Those beings who do not practice the conduct of a bodhisattva For the sake of desires or for the sake of enjoyments— How happy they are To seek the wisdom of a buddha. “ ‘

source: །སྟོང་གསུམ་རིན་ཆེན་རྣམས་དང་ནི། །གོས་དང་ཡུལ་གཞན་ལྷ་རྫས་ཀྱིས། །ཆལ་པར་བཀང་བར་གྱུར་ཀྱང་ནི། །དེ་དག་ཆགས་པར་བྱ་མི་ནུས།
en: Even if the billionfold universe Were filled with jewels, garments, And other objects and strewn with silk, They could not become attached. “ ‘

source: །མི་ཤེས་པས་ནི་གང་བྱས་པའི། །སྡིག་པའི་ལས་ནི་བཤགས་པར་གྱིས།
en: You should confess any sinful acts That you have committed out of ignorance.

source: །མཁས་པ་ཉེས་པ་བཤགས་ནས་ནི། །ལས་དང་ལྷན་ཅིག་མི་གནས་སོ། །འོད་སྲུང་དེ་ལྟར་ལྷ་དེས་བསྐུལ་བ་ན་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཆེན་པོ་དེའི་ཕ་མ་དེ་གཉིས་དང་། མཛའ་བཤེས་དང་།
en: A wise person, after confessing their faults, Does not persist in those acts.’ “

source: གྲོས་གྲོགས་དང་། ཉེ་དུ་དང་། རྒན་རབས་དེ་དག་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་གིས་ཉེས་པ་ལ་ཉེས་པར་བཤགས་ནས་གཞོན་ནུ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་ཏེ། གཞོན་ནུ་ཁྱོད་ཇི་ལྟར་བསམས་པ་བཞིན་སོང་ཤིག །
en: Kāśyapa, when the deity admonished them in this way, the bodhisattva Great Diligence’s parents, friends, confidants, relatives, and elders and those crowds of people confessed their faults and then said to the young man, ‘Young man, you should leave just as you intended and go forth!

source: རབ་ཏུ་ཡང་བྱུང་ཤིག །ཟན་ཡང་ཟོ་ཤིག །
en: Eat some food!

source: ཟས་མ་ཟོས་པས་འཆི་བའི་དུས་བྱས་པར་གྱུར་ཏ་རེ་ཞེས་བྱས་སོ།
en: If you do not eat you will certainly die.’ “

source: །འོད་སྲུང་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཆེན་པོ་དེས་ཞག་བདུན་གྱི་བར་དུ་ཟན་བཅད་དུ་ཟིན་ཀྱང་འདི་ལྟ་སྟེ། སངས་རྒྱས་དང་འབྲེལ་པའི་ཡིད་ལ་བྱེད་པ་དང་ཞག་བདུན་གྱི་བར་དུ་ལྷ་རྣམས་ཀྱིས་དེའི་ལུས་ལ་མདངས་བཅུག་པས་ན། དབང་པོ་རྣམས་གཞན་དུ་གྱུར་པར་ཡང་མ་གྱུར། བཞིན་གྱི་མདངས་ཡོངས་སུ་ཉམས་པར་ཡང་མ་གྱུར་ཏོ།
en: Kāśyapa, even though the bodhisattva Great Diligence had stopped eating for seven days, because his thoughts were connected with the buddhas, and because for seven days the deities infused his body with vitality, his faculties were unaltered, and the splendor of his face had not faded. “

source: །འོད་སྲུང་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཆེན་པོ་དེས་དེ་ལྟར་ཞག་བདུན་གྱི་བར་དུ་ཟན་བཅད་དེ་ཁྱིམ་གྱི་གནས་ལ་མི་ལྟ་ཞིང་རྒྱལ་སྲིད་ཆེན་པོ་དེ་མཆིལ་མའི་ཐལ་བ་བཞིན་དུ་བོར་ནས་བུད་མེད་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དེ་དག་དང་། ཕ་མ་དང་། ཉེ་དུའི་ཚོགས་དེ་དག་གདོང་མཆི་མས་གང་སྟེ་ངུ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་དེ་ཁྱེར་ཏེ་རང་གི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བྱུང་ནས་དགོན་པ་མི་མེད་པ། གཅན་གཟན་གདུག་པ་གནས་པའི་ནགས་ཤིག་ཏུ་ཞུགས་སོ།
en: That is how, Kāśyapa, the bodhisattva Great Diligence stopped eating for seven days and, without regard for his home, cast aside his great kingdom as if spitting into the dirt. Then, while the eighty-four thousand women, his parents, and the assembled relatives wept with tearful faces, he carried the image of the Tathāgata out of his own city and went into an unpopulated wilderness, a forest where wild animals lived. “

source: །དེ་དེར་ཞུགས་ནས་རས་བཅོས་བུའི་གཞི་གང་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་དེ་བྲིས་པའི་རས་བཅོས་བུའི་གཞི་དེ་བྲེས་ནས།
en: After he got there, he spread out the cotton canvas on which the image of the Tathāgata had been drawn.

source: རས་བཅོས་བུའི་གཞི་དེ་ཉིད་ཀྱི་མདུན་དུ་རྩྭའི་གདིང་བ་བཏིང་བའི་སྟེང་དུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་ལུས་དྲང་པོར་བསྲང་སྟེ་འདུག་ནས་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་དེ་ལ་རྟོག་པར་བྱེད་དོ།
en: Then, in front of that cotton canvas, he sat down cross-legged on a mat of grass and in an upright posture and analyzed that image of the Tathāgata.

source: །དེ་དེ་ལ་རྟོག་པར་བྱེད་པ་ན་འདི་སྙམ་དུ་སེམས་ཏེ། གང་གི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་འདི་ཡང་འདི་ཙམ་དུ་མཛེས་པ་ཡིན་ན། བཅོམ་ལྡན་འདས་དེ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ།
en: As he analyzed it, he thought, ‘Because even this image of the Tathāgata is so beautiful, it is needless to say that the Blessed One himself is too.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དེ་ཙམ་དུ་མཛེས་པ་ནི་ངོ་མཚར་བས་གང་དག་གིས་དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་བ་དེ་དག་ནི་དཔལ་ཡོན་ཅན་ཡིན་ནོ་སྙམ་མོ།
en: And because such a beautiful blessed buddha is a marvel, whoever sees the Tathāgata is fortunate.’

source: །དེ་འདི་སྙམ་དུ་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་བལྟ་བར་བྱ་སྙམ་དུ་སེམས་པར་ཡང་གྱུར་ཏོ།
en: And he reflected on how one should visualize the Tathāgata. “

source: །དེ་ནས་ནགས་ཁྲོད་དེ་ན་ལྷ་ཞིག་གནས་པར་གྱུར་པ་གང་ཡིན་པ་དེས་བྱང་ཆུབ་སེམས་དཔའ་དེའི་སེམས་ཀྱི་རྟོག་པ་སེམས་ཀྱིས་ཡོངས་སུ་ཤེས་ནས། བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོགས་པོ་ཁྱོད་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་བལྟ་བར་བྱ་སྙམ་དུ་རྣམ་པར་རྟོག་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་འདི་ཇི་ལྟ་བ་དེ་བཞིན་དུ་བལྟ་བར་བྱ་ཞིང་།
en: Then, a deity who lived in the forest, who was aware of the thoughts of the bodhisattva, said to him, ‘Friend, with regard to the thoughts you are engaged in about how to visualize the Tathāgata, you should visualize him just like this image of the Tathāgata.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་འདི་ཇི་ལྟར་མཐོང་བ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་ཡང་བལྟ་བར་བྱ་སྟེ།
en: The way this image of the Tathāgata is seen is the way the Tathāgata should be visualized.

source: དེ་ལྟར་མཐོང་ན་དེ་བཞིན་གཤེགས་པ་ལེགས་པར་མཐོང་བ་ཡིན་ནོ།
en: Seeing it this way, one sees the Tathāgata correctly.’ “

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཆེན་པོ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཇི་ལྟར་བལྟས་ན་དེ་བཞིན་གཤེགས་པ་མཐོང་བར་འགྱུར་བར་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་འདི་ལ་ཇི་ལྟར་བལྟ་བར་བྱ་སྙམ་ནས།
en: Then the bodhisattva Great Diligence wondered, ‘How should one visualize this image of the Tathāgata so that one will see the Tathāgata?’

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་འདི་སེམས་པར་མི་བྱེད། རྣམ་པར་ཤེས་པར་མི་བྱེད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་སེམས་པར་མི་བྱེད། རྣམ་པར་ཤེས་པར་མི་བྱེད་དེ།
en: Then he thought, ‘Just as this image of the Tathāgata does not think and is not conscious, so too do no phenomena think nor are they conscious.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་ཡང་མཚན་ཉིད་དེ་ལྟ་བུ་ཡིན་ནོ།
en: The body of the Tathāgata is also characterized in that way.

source: །ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་འདི་མིང་དུ་བཏགས་པ་ཙམ་དུ་ཟད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་མིང་དུ་བཏགས་པ་ཙམ་དུ་ཟད་ལ། མིང་དེ་ཡང་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་དང་། རང་བཞིན་གྱིས་གཡོ་བ་མེད་པ་ཡིན་ཏེ།
en: Just as this image of the Tathāgata amounts to nothing more than a label, so too all phenomena amount to nothing more than labels, which are empty in essence and unmoving by nature.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་ཡང་མཚན་ཉིད་དེ་ལྟ་བུ་ཡིན་ནོ། །ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་འདི་ལ་ཐོབ་པ་མེད་པ་དང་། མངོན་པར་རྟོགས་པ་མེད་པ་དང་། ཤེས་པ་མེད་པ་དང་། མངོན་སུམ་དུ་བྱ་བ་མེད་པ་དང་། འབྲས་བུ་མེད་པ་དང་། འབྲས་བུ་རྟོགས་པ་མེད་པ་དང་། གནས་མེད་པ་དང་། རྟེན་མེད་པ་དང་། འགྲོ་བ་མེད་པ་དང་། འོང་བ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་དང་། སྒྲ་མེད་པ་དང་། ཚུལ་མེད་པ་དང་། ཚུལ་མ་ཡིན་པ་མེད་པ་དང་།
en: The body of the Tathāgata is also characterized in that way.

source: འདོད་ཆགས་ཟད་པ་མེད་པ་དང་། ཞེ་སྡང་ཟད་པ་མེད་པ་དང་། གཏི་མུག་ཟད་པ་མེད་པ་དང་། ཕུང་པོ་རྣམས་མེད་པ་དང་། ཁམས་རྣམས་མེད་པ་དང་། སྐྱེ་མཆེད་རྣམས་མེད་པ་དང་།
en: Just as this image of the Tathāgata is without attainment, without realization, without knowledge, without actualization, without fruition, without realization of fruition, without a ground, without a basis, without going, without coming, without arising, without ceasing, without pollution, without purification, without sound, without what is proper, without what is improper, without the extinguishing of desire, without the extinguishing of anger, without the extinguishing of ignorance, without aggregates, without elements, without sense fields, without what is prior, without what is later, and without what is in between, so too are all phenomena.

source: སྔོན་གྱི་མཐའ་མེད་པ་དང་། ཕྱི་མའི་མཐའ་མེད་པ་དང་། དབུས་མེད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་དེ་དང་འདྲ་སྟེ། དེ་བཞིན་གཤེགས་པའི་སྐུ་ཡང་མཚན་ཉིད་དེ་ལྟ་བུ་ཡིན་ནོ།
en: The body of the Tathāgata is also characterized in that way.

source: །ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་འདི་གཡོ་བ་མེད་པ་དང་། སྤྱོད་པ་མེད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་དེ་དང་འདྲ་སྟེ།
en: Just as this image of the Tathāgata is unmoving and inactive, so are all phenomena.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་ཡང་མཚན་ཉིད་དེ་ལྟ་བུ་ཁོ་ན་ཡིན་ནོ།
en: The body of the Tathāgata is characterized in exactly the same way.

source: །ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་འདི་ལྟ་བར་མི་བྱེད། ཉན་པར་མི་བྱེད། སྣོམ་པར་མི་བྱེད། མྱོང་བར་མི་བྱེད། རེག་པར་མི་བྱེད། སེམས་པར་མི་བྱེད། ཉལ་བར་མི་བྱེད།
en: Just as this image of the Tathāgata does not look, does not listen, does not smell, does not taste, does not touch, does not think, does not lie down, does not get up, does not exhale, does not inhale, and is not conscious, so too all phenomena.

source: ལྡང་བར་མི་བྱེད། དབུགས་འབྱུང་བར་མི་བྱེད། དབུགས་རྔུབ་པར་མི་བྱེད། རྣམ་པར་ཤེས་པར་མི་བྱེད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་དེ་དང་འདྲ་སྟེ། ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཡང་མཚན་ཉིད་དེ་ལྟ་བུ་ཡིན་ནོ།
en: Just like all phenomena, the body of the Tathāgata is also characterized in that way.

source: །ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་འདི་འདོད་པའི་ཁམས་སུ་གཏོགས་པ་ཡང་མ་ཡིན། གཟུགས་ཀྱི་ཁམས་སུ་གཏོགས་པ་ཡང་མ་ཡིན། གཟུགས་མེད་པའི་ཁམས་སུ་གཏོགས་པ་ཡང་མ་ཡིན་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་དེ་དང་འདྲ་སྟེ།
en: Just as this image of the Tathāgata is not included in the desire realm, is not included in the form realm, and is not included in the formless realm, so too all phenomena.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་ཡང་མཚན་ཉིད་དེ་ལྟ་བུ་ཡིན་ནོ། །ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་འདི་ལ་ཚུ་རོལ་ཡང་མེད། ཕ་རོལ་ཡང་མེད། བར་ཡང་མེད། ཐོག་མ་ཡང་མེད། འཇིག་པ་ཡང་མེད། རྒྱུ་བ་ཡང་མེད། སྤྱོད་པ་ཡང་མེད། བླང་བ་ཡང་མེད། དོར་བ་ཡང་མེད། བྱ་བ་ཡང་མེད།
en: The body of the Tathāgata is also characterized in that way.

source: བྱེད་པ་ཡང་མེད། ལྟུང་བ་ཡང་མེད། བདེན་པ་ཡང་མེད། བརྫུན་པ་ཡང་མེད། བདེན་པ་མངོན་པར་རྟོགས་པ་ཡང་མེད།
en: Just as this image of the Tathāgata has no near shore, has no far shore, has no middle, has no beginning, has no destruction, has no movement, has no activity, has no acceptance, has no rejection, has no action, has no agent, has no transgression, has no truth, has no falsehood, has no realization of truth, has no attraction, has no repulsion, has no saṃsāra, and has no nirvāṇa, so too all phenomena.

source: ཀུན་ཏུ་འདོད་ཆགས་པ་ཡང་མེད། ཡིད་འབྱུང་བ་ཡང་མེད། འཁོར་བ་ཡང་མེད། མྱ་ངན་ལས་འདས་པ་ཡང་མེད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་དེ་དང་འདྲ་སྟེ། ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཡང་མཚན་ཉིད་དེ་ལྟ་བུ་ཡིན་ནོ་སྙམ་མོ།
en: Just like all phenomena, the body of the Tathāgata is also characterized in that way.’ “

source: །འོད་སྲུང་དེ་ལྟར་དེ་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་འཇུག་པ་དེ་ལྟ་བུ་དེས་རབ་ཏུ་རྟོག་པར་བྱེད་པ་ན་ཉིན་མཚན་དུ་སྐྱིལ་མོ་ཀྲུང་ཞིག་པར་མ་གྱུར་ཅིང་དེས་ཉིན་མཚན་དེ་ལ་མངོན་པར་ཤེས་པ་ལྔ་དང་།
en: Kāśyapa, Great Diligence engaged with and analyzed the body of the Tathāgata in this way for a day and night, without moving from his cross-legged posture.

source: ཚངས་པའི་གནས་པ་བཞི་དང་། སྤོབས་པ་ཐོགས་པ་མེད་པ་དག་ཀྱང་བསྒྲུབས་པར་གྱུར།
en: In that day and night he accomplished the five extraordinary abilities, the four sublime states, and unimpeded eloquence.

source: ཏིང་ངེ་འཛིན་ཀུན་ཏུ་སྣང་བ་ཞེས་བྱ་བ་ཡང་བསྒྲུབས་པར་གྱུར་ནས་དེ་ལ་སྣང་བ་ཡང་བྱུང་བར་གྱུར་ཏེ།
en: He also accomplished the all-illuminating samādhi, after which luminosity arose.

source: སྣང་བ་བྱུང་བར་གྱུར་པ་དེས་ལྷའི་མིག་རྣམ་པར་དག་པ་མིའི་ལས་ཤིན་ཏུ་འདས་པས་ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་ཀྱང་མཐོང་ངོ་།
en: Because of that luminosity, with the pure divine eye that transcends human sight he saw the incalculable, countless blessed buddhas of the ten directions.

source: །ལྷའི་རྣ་བ་སྒྲིབ་པ་མེད་པས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཆོས་བསྟན་པ་ཐམས་ཅད་ཀྱང་ཐོས་ཏེ།
en: With his unimpeded divine ear he also heard all the Dharma taught by those blessed buddhas.

source: དེ་བཞིན་གཤེགས་པ་གཅིག་གིས་ཆོས་བསྟན་པ་ཡང་དེ་བཞིན་གཤེགས་པ་གཉིས་པས་ཆོས་བསྟན་པ་ལ་སྒྲིབ་པར་མ་གྱུར་ཅིང་ཐམས་ཅད་ཀྱང་མཉེས་པར་བྱས་སོ།
en: The Dharma taught by one tathāgata did not impede the Dharma taught by a second tathāgata; it pleased everyone. “

source: །འོད་སྲུང་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཆེན་པོ་དེ་ཟླ་བ་བདུན་གྱི་བར་དུ་འཆག་ཅིང་འདུག་པར་གྱུར་ཏེ། ཤེས་པའི་ཟས་མ་གཏོགས་པར་ཟས་གཞན་ཡང་མི་ཟ་ཞིང་ལྷ་རྣམས་ཀྱིས་དེའི་ལྷག་པའི་བསམ་པ་རིག་ནས་དེའི་ལུས་ལ་མདངས་བཅུག་པར་ཡང་གྱུར་ཏོ།
en: Kāśyapa, the bodhisattva Great Diligence walked and sat there for seven months, eating no food other than the food of consciousness, while the deities, aware of his noble intention, infused his body with vitality. “

source: །འོད་སྲུང་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཆེན་པོ་དེས་གོས་ངུར་སྨྲིག་དག་ཀྱང་མ་བགོས།
en: Kāśyapa, the bodhisattva Great Diligence did not even wear saffron robes.

source: །དེ་བཞིན་གཤེགས་པ་ཡང་མངོན་སུམ་དུ་མ་མཐོང་།
en: He did not actually see the Tathāgata.

source: བསླབ་པའི་གཞི་རྣམས་ཀྱང་མ་བླངས་མོད་ཀྱི།
en: He did not receive the fundamental precepts.

source: འོན་ཀྱང་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྗེས་སུ་ཐོབ་ཅིང་དེ་ལྟར་བསླབ་པ་འདོད་པར་གྱུར་པ་ལ་ལྟོས།
en: Yet, even so, consider his wish to train himself in order to attain the wisdom of omniscience. “

source: འོད་སྲུང་བྱང་ཆུབ་སེམས་དཔའ་ནི་འདི་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྐུ་རབ་ཏུ་རྣམ་པར་འབྱེད་དེ།
en: Kāśyapa, this is how a bodhisattva discerns the body of the Tathāgata.

source: ཅི་ནས་ཀྱང་འཕེལ་བར་མི་བྱེད་པ་དང་། འབྲི་བར་མི་བྱེད་པ་དེ་དེ་ལྟར་རབ་ཏུ་རྣམ་པར་འབྱེད་དོ།
en: He certainly does not augment or diminish it—that is how he discerns it. “

source: །འོད་སྲུང་བྱང་ཆུབ་སེམས་དཔས་ནི་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཆེན་པོ་དེས་དེ་བཞིན་གཤེགས་པའི་སྐུ་དེ་ལ་བསྙེན་བཀུར་བྱས་པ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་བསྙེན་བཀུར་བྱའོ།
en: Kāśyapa, a bodhisattva should honor the body of the Tathāgata just as the bodhisattva great being Great Diligence honored the body of the Tathāgata.

source: །དེས་དེ་ལྟར་བསྙེན་བཀུར་བྱས་ཤིང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་རྟོག་པར་བྱེད་པ་ན་ཡེ་ཤེས་ཆེན་པོའི་རྣམ་པ་འདི་ལྟ་བུ་དག་ཀྱང་བསྐྱེད་པར་གྱུར་ཏེ།
en: When he honored it in that way, analyzing it as it really is, he also developed the trait of great wisdom.
